In [3]:
                        pip install pandas

Requirement already satisfied: pandas in c:\users\owner\anaconda3\lib\site-packages (0.25.1)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\owner\anaconda3\lib\site-packages (from pandas) (2.8.0)
Requirement already satisfied: numpy>=1.13.3 in c:\users\owner\anaconda3\lib\site-packages (from pandas) (1.16.5)
Requirement already satisfied: pytz>=2017.2 in c:\users\owner\anaconda3\lib\site-packages (from pandas) (2019.3)
Requirement already satisfied: six>=1.5 in c:\users\owner\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.12.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
# series in Pandas- 
 # main data type
# series is very similar to the Numpy array, 
# series can be indexed by labels 
# Series can hold veraity of objects which is not possible for numpy array

import numpy as np
import pandas as pd

labels =['a','b','c']
my_data = [10,20,30]  
arr = np.array(my_data)

d = {'a':10,'b':20,'c':20}

pd.Series(data = my_data) # creating the series

{'a': 10, 'b': 20, 'c': 20}

In [4]:
pd.Series(data=my_data,index= labels) # ascribing index 
                                     # index is a , can be called by the index

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(arr,labels) # passing a numpy array as data

print(pd.Series(d)) # a faster way of making a series

pd.Series(data=[sum,print,len])

a    10
b    20
c    20
dtype: int64

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [7]:
#key of using indexing is to knowing how to use index

ser1 = pd.Series([1,2,3,4],['use','ger','ussr','japan'])
ser2 = pd.Series([1,2,5,4],['use','ger','Italy','japan'])

In [8]:
ser1['use']

ser3 = pd.Series(data=labels)
ser3[0]

'a'

In [10]:
# adding series 
ser1 + ser2 # puts the NAN item when there is not a match
            # adds the values based on index
            # whenever we adding a series our integers becomes our flot

Italy    NaN
ger      4.0
japan    8.0
use      2.0
ussr     NaN
dtype: float64

In [11]:
#Data frame
from numpy.random import randn
np.random.seed(101)

In [11]:
from numpy.random import randn #import randn from numpy
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df #looks and feel like excel 
# list of columns w x y z, 
#dataframe is buunch of index that share an Index

          W         X         Y         Z
A  0.554340 -0.666393  0.877102  0.197130
B  0.559148  0.227695 -0.446937  0.459081
C -0.226099 -0.314497  0.261160  0.283840
D  0.716541  2.431159 -0.032001  0.166908
E -0.120388 -2.275040 -0.983589 -0.487145

In [12]:
df['W'] #rows and columns are case sensitive #output as Series

A    0.554340
B    0.559148
C   -0.226099
D    0.716541
E   -0.120388
Name: W, dtype: float64

type(df['W'])

In [13]:
df[['W','Z']] # output as dataframe

          W         Z
A  0.554340  0.197130
B  0.559148  0.459081
C -0.226099  0.283840
D  0.716541  0.166908
E -0.120388 -0.487145

In [14]:
df['new'] = df['W'] + df['Y']
df    # to add new column

          W         X         Y         Z       new
A  0.554340 -0.666393  0.877102  0.197130  1.431443
B  0.559148  0.227695 -0.446937  0.459081  0.112211
C -0.226099 -0.314497  0.261160  0.283840  0.035061
D  0.716541  2.431159 -0.032001  0.166908  0.684540
E -0.120388 -2.275040 -0.983589 -0.487145 -1.103978

In [15]:
# dropping column
df.drop('new',axis = 1,inplace =True) # by default its axis = 0 which will not allows us to drop the column 
#inplace will actually delete the column

In [34]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [36]:
#dropping row for rows axis should be 0
df.drop('E',axis = 0)
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [41]:
#selectig rows 
df.loc['A'] #returns series like columns 

df.iloc[0] # both returs the same thing

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [42]:
df.loc['B','Y']

0.16690463609281317

In [43]:
df.loc[['A','B'],['W','Y']]  # Accessing both rows and column

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

In [47]:
#conditional selection in pandas very similar to Numpy
booldf = df > 0 # true is value is > 0 else less than 0
booldf

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [49]:
df[booldf] # true with value and NAN when false

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [17]:
df[df['W'] < 1]

          W         X         Y         Z
A  0.554340 -0.666393  0.877102  0.197130
B  0.559148  0.227695 -0.446937  0.459081
C -0.226099 -0.314497  0.261160  0.283840
D  0.716541  2.431159 -0.032001  0.166908
E -0.120388 -2.275040 -0.983589 -0.487145

In [53]:
df[df['Z']<0] # CONDITION ON ROW

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

In [58]:
df[df['W']>0][['Y','X']]

          Y         X
A -1.706086  1.693723
C  0.638787  0.072960

In [64]:
boolser = df['W']>0
result = df[boolser]
mycols=['Y','X']
result[mycols]

          Y         X
A -1.706086  1.693723
C  0.638787  0.072960

In [66]:
df[(df['W']>0) and (df['Y']>1)] # error becasue and operator can only take single booleen value so we use &

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [19]:
df[(df['W']>0) & (df['Y']>1)]

df[(df['W']>0) | (df['Y']>1)] # or implementation in pandas

df

          W         X         Y         Z
A  0.554340 -0.666393  0.877102  0.197130
B  0.559148  0.227695 -0.446937  0.459081
C -0.226099 -0.314497  0.261160  0.283840
D  0.716541  2.431159 -0.032001  0.166908
E -0.120388 -2.275040 -0.983589 -0.487145

In [18]:
# INDEX DETAILS
df.reset_index()

  index         W         X         Y         Z
0     A  0.554340 -0.666393  0.877102  0.197130
1     B  0.559148  0.227695 -0.446937  0.459081
2     C -0.226099 -0.314497  0.261160  0.283840
3     D  0.716541  2.431159 -0.032001  0.166908
4     E -0.120388 -2.275040 -0.983589 -0.487145

In [23]:
newind = 'CA NY WY OR CO'.split()

In [22]:
newind

list

In [24]:
df['states'] = newind
df

          W         X         Y         Z states
A  0.554340 -0.666393  0.877102  0.197130     CA
B  0.559148  0.227695 -0.446937  0.459081     NY
C -0.226099 -0.314497  0.261160  0.283840     WY
D  0.716541  2.431159 -0.032001  0.166908     OR
E -0.120388 -2.275040 -0.983589 -0.487145     CO

In [25]:
df.set_index('states') #changing the index thats set index vs reset index

               W         X         Y         Z
states
CA      0.554340 -0.666393  0.877102  0.197130
NY      0.559148  0.227695 -0.446937  0.459081
WY     -0.226099 -0.314497  0.261160  0.283840
OR      0.716541  2.431159 -0.032001  0.166908
CO     -0.120388 -2.275040 -0.983589 -0.487145

In [26]:
#muliple index and index hirearchi 
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index =list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [83]:
pd.DataFrame(randn(6,2),hier_index,['A','B']) #multi index labeled dataframe

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [27]:
df.index.names = ['Group','Num']

ValueError: Length of new names must be 1, got 2

In [92]:
df.loc(G2).loc(2) # not working

NameError: name 'G2' is not defined

In [97]:
#cross section
df.xs['G1'] #not working

TypeError: 'method' object is not subscriptable

In [100]:
#missig data
#create dataframe form dictionary
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df= pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [101]:
#drop na value in the df
df.dropna() # bydefault it drops rows

     A    B  C
0  1.0  5.0  1

In [28]:
df.dropna(axis=1) #drop column with Null value in it

          W         X         Y         Z states
A  0.554340 -0.666393  0.877102  0.197130     CA
B  0.559148  0.227695 -0.446937  0.459081     NY
C -0.226099 -0.314497  0.261160  0.283840     WY
D  0.716541  2.431159 -0.032001  0.166908     OR
E -0.120388 -2.275040 -0.983589 -0.487145     CO

In [103]:
#threshold
df.dropna(thresh=2) # kept atleast two rows with two non na values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [105]:
#fill value 
df.fillna(value='Fill Value')

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [106]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [29]:
#Group by in pandas
data ={'Company':['GooG','GooG','MSFT','MSFT','FB','FB'],
      'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
      'Sales':[200,120,340,124,243,350]}

In [30]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GooG      Sam    200
1    GooG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [113]:
bycom= df.groupby('Company')
bycom.mean() #automatically ignores non numeric values

         Sales
Company
FB       296.5
GooG     160.0
MSFT     232.0

In [114]:
bycom.sum()

         Sales
Company
FB         593
GooG       320
MSFT       464

In [120]:
bycom.sum().loc['FB'] # all the time we get a Dataframe

Sales    593
Name: FB, dtype: int64

In [122]:
df.groupby('Company').sum().loc['FB'] #mostly9 we will be using it in one line

Sales    593
Name: FB, dtype: int64

In [123]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GooG         Sam    200
MSFT     Vanessa    340

In [128]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [ ]:
#merging joining and concatenating

In [32]:
#operations
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [33]:
df['col2'].unique() #unique values

array([444, 555, 666], dtype=int64)

In [132]:
df['col2'].nunique() # number of unique values

3

In [133]:
df['col2'].value_counts() # how many times each unique values occur in colomn

444    2
555    1
666    1
Name: col2, dtype: int64

In [134]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [136]:
#apply method
def times2(x): # we create a function
    return x*2

df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [139]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [ ]:
#remove column 1
df.drop('col1',axis=1,inplace =True)

In [140]:
#sorting
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [141]:
#is null
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [144]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
       'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [147]:
df.pivot_table(values ='D',index =['A','B'],columns =['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [151]:
pip install sqlalchemy
conda install lxml
conda install html5lib
conda install BeautifulSoup4

SyntaxError: invalid syntax (<ipython-input-151-86acbf4f9d1d>, line 1)